In [24]:
import numpy as np
### Задание №1
a = np.array([[1, 6], 
              [2, 8], 
              [3, 11], 
              [3, 10], 
              [1, 7]])

mean_a = np.mean(a, axis = 0)
print('mean_a = ', mean_a)

mean_a =  [2.  8.4]

In [25]:
### Задание №2
a_centered = a - mean_a
print (a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

In [26]:
### Задание №3
a_centered_sp = a_centered[0:,1] @ a_centered[0:,0]
a_centered_sp / (a.shape[0]-1)

2.0

In [27]:
### Задание 4**
(np.cov(a.T))[0,1]

2.0

In [28]:
import pandas as pd
#Задание 1
a = {
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

authors = pd.DataFrame(a)

a = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин',
                   'Дворянское гнездо',
                   'Толстый и тонкий',
                   'Дама с собачкой',
                   'Гроза',
                   'Таланты и поклонники'],
    "price" : [450, 300, 350, 500, 450, 370, 290]
}

book = pd.DataFrame(a)

In [54]:
#Задание 2
authors_price= pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [30]:
#Задание 3
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [48]:
#Задание 4
df1 = authors_price.groupby('author_name').agg({'price': 'min'}).rename(columns={'price':'min_price'})
df2 = authors_price.groupby('author_name').agg({'price': 'max'}).rename(columns={'price':'max_price'})
df3 = authors_price.groupby('author_name').agg({'price': 'mean'}).rename(columns={'price':'mean_price'})
authors_stat=pd.concat([df1, df2, df3], axis = 1)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [59]:
a = {
    "book_title": ['Отцы и дети', 'Рудин',
                   'Дворянское гнездо',
                   'Толстый и тонкий',
                   'Дама с собачкой',
                   'Гроза',
                   'Таланты и поклонники'],
    "cover": ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
}

cover = pd.DataFrame(a)
authors_price= pd.merge(authors_price, cover, on='book_title', how='outer')
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [60]:
 ?pd.pivot_table

In [69]:
table = pd.pivot_table(authors_price, values='price', index=['author_name'],
                       columns=['cover'], aggfunc=np.sum, fill_value=0)
table

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [71]:
book_info = table
book_info.to_pickle('book_info.pkl')

In [72]:
book_info2 = pd.read_pickle('book_info.pkl')

In [73]:
book_info==book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True